; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-3-5-2-8-8-5) (:domain depots)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 distributor3 distributor4 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 - Pallet
	crate0 crate1 crate2 crate3 crate4 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate3)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear crate4)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 distributor3)
	(clear crate2)
	(at pallet7 distributor4)
	(clear crate1)
	(at truck0 distributor4)
	(at truck1 depot2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor3)
	(available hoist6)
	(at hoist7 distributor4)
	(available hoist7)
	(at crate0 distributor4)
	(on crate0 pallet7)
	(at crate1 distributor4)
	(on crate1 crate0)
	(at crate2 distributor3)
	(on crate2 pallet6)
	(at crate3 depot1)
	(on crate3 pallet1)
	(at crate4 distributor0)
	(on crate4 pallet3)
)

(:goal (and
		(on crate1 pallet7)
		(on crate2 pallet2)
		(on crate3 pallet1)
		(on crate4 pallet0)
	)
))

; plan
1. (lift hoist7 crate1 crate0 distributor4)
   deleted: (at crate1 distributor4) (available hoist7) (on crate1 crate0) (clear crate1)
   added: (lifting hoist7 crate1) (clear crate0)
   goals met: 1 of 4
2. (load hoist7 crate1 truck0 distributor4)
   deleted: (lifting hoist7 crate1)
   added: (in crate1 truck0) (available hoist7)
   goals met: 1 of 4
3. (lift hoist7 crate0 pallet7 distributor4)
   deleted: (at crate0 distributor4) (available hoist7) (on crate0 pallet7) (clear crate0)
   added: (lifting hoist7 crate0) (clear pallet7)
   goals met: 1 of 4
4. (load hoist7 crate0 truck0 distributor4)
   deleted: (lifting hoist7 crate0)
   added: (in crate0 truck0) (available hoist7)
   goals met: 1 of 4
5. (unload hoist7 crate1 truck0 distributor4)
   deleted: (available hoist7) (in crate1 truck0)
   added: (lifting hoist7 crate1)
   goals met: 1 of 4
6. (lift hoist6 crate2 pallet6 distributor3)
   deleted: (at crate2 distributor3) (available hoist6) (on crate2 pallet6) (clear crate2)
   added: (lifting hoist6 crate2) (clear pallet6)
   goals met: 1 of 4
7. (drive truck0 distributor4 distributor3)
   deleted: (at truck0 distributor4)
   added: (at truck0 distributor3)
   goals met: 1 of 4
8. (load hoist6 crate2 truck0 distributor3)
   deleted: (lifting hoist6 crate2)
   added: (in crate2 truck0) (available hoist6)
   goals met: 1 of 4
9. (lift hoist3 crate4 pallet3 distributor0)
   deleted: (at crate4 distributor0) (available hoist3) (on crate4 pallet3) (clear crate4)
   added: (lifting hoist3 crate4) (clear pallet3)
   goals met: 1 of 4
10. (drive truck0 distributor3 distributor0)
   deleted: (at truck0 distributor3)
   added: (at truck0 distributor0)
   goals met: 1 of 4
11. (load hoist3 crate4 truck0 distributor0)
   deleted: (lifting hoist3 crate4)
   added: (in crate4 truck0) (available hoist3)
   goals met: 1 of 4
12. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 1 of 4
13. (unload hoist0 crate4 truck0 depot0)
   deleted: (available hoist0) (in crate4 truck0)
   added: (lifting hoist0 crate4)
   goals met: 1 of 4
14. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   goals met: 1 of 4
15. (drop hoist0 crate4 pallet0 depot0)
   deleted: (lifting hoist0 crate4) (clear pallet0)
   added: (at crate4 depot0) (available hoist0) (on crate4 pallet0) (clear crate4)
   goals met: 2 of 4
16. (drop hoist7 crate1 pallet7 distributor4)
   deleted: (lifting hoist7 crate1) (clear pallet7)
   added: (at crate1 distributor4) (available hoist7) (on crate1 pallet7) (clear crate1)
   goals met: 3 of 4
17. (unload hoist2 crate2 truck0 depot2)
   deleted: (available hoist2) (in crate2 truck0)
   added: (lifting hoist2 crate2)
   goals met: 3 of 4
18. (drop hoist2 crate2 pallet2 depot2)
   deleted: (lifting hoist2 crate2) (clear pallet2)
   added: (at crate2 depot2) (available hoist2) (on crate2 pallet2) (clear crate2)
   goals met: 4 of 4
